#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=eh5mzxa31b]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=92o144]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-eh5mzxa31b-92o144-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210910222023809000000001]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-eh5mzxa31b-92o144-GET]
module.network.aws_api_gateway_deployment.example: Refreshing state... [id=4m8lgd]
module.network.aws_api_gateway_stage.example: Refreshing state... [id=ags-eh5mzxa31b-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_s3_bucket_object.minimal_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "minimal_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 620 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "3748aa19a69ab8afa40e8bcdec726ab5" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Tue, 14 Sep 2021 19:47:25 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.data.aws_s3_bucket_object.sample_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "sample_function_zip"  {
      + body                          = (known after apply)
      + bucket                        = "kpinetwork-backend"
      + bucket_key_enabled            = (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      + content_length                = (known after apply)
      + content_type                  = (known after apply)
      + etag                          = (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      + id                            = (known after apply)
      + key                           = "testSampleHandler.zip"
      + last_modified                 = (known after apply)
      + metadata                      = (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      + storage_class                 = (known after apply)
      + tags                          = (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "3748aa19a69ab8afa40e8bcdec726ab5" -> "aa8ee004026f09d94904b8af0daf644d"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.sample_function_object will be created
  + resource "aws_s3_bucket_object" "sample_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "5d9b1103a5c6561eea0d447f84215446"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "testSampleHandler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/testSampleHandler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-14T19:47:25.034+0000" -> (known after apply)
      ~ source_code_hash               = "lYyvl0NHIVD0g1d8+iWuLaFaonypy6tCDzz8Un+VTOM=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.sample_lambda_function will be created
  + resource "aws_lambda_function" "sample_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "sample_lambda_function"
      + handler                        = "testSampleHandler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::435552912911:role/lambda_exec"
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "testSampleHandler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.logs.aws_cloudwatch_log_group.sample_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "sample_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sample_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.integration_sample will be created
  + resource "aws_api_gateway_integration" "integration_sample" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "eh5mzxa31b"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.method_sample will be created
  + resource "aws_api_gateway_method" "method_sample" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "eh5mzxa31b"
    }

  # module.network.aws_api_gateway_resource.test will be created
  + resource "aws_api_gateway_resource" "test" {
      + id          = (known after apply)
      + parent_id   = "fu2bl6yong"
      + path        = (known after apply)
      + path_part   = "test"
      + rest_api_id = "eh5mzxa31b"
    }

  # module.policy.aws_lambda_permission.apigw_sample_lambda will be created
  + resource "aws_lambda_permission" "apigw_sample_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "sample_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 7 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ridouku, Action: `pull_request`*